app/controllers/domains_controller.rb

  def index
    # @domains = Domain.all
    @domains=Domain.paginate :page => params[:page],  :order => 'created_at DESC'
---
SELECT * FROM "domains" WHERE (name like '%%') ORDER BY name LIMIT 5 OFFSET 0
SELECT count(*) AS count_all FROM "domains"

  def show
    @domain = Domain.find(params[:id])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 1)

  def edit
    @domain = Domain.find(params[:id])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 2)

  def create
    @domain = Domain.new(params[:domain])

    respond_to do |format|
      if @domain.save
---
INSERT INTO "domains" ("name", "ttl", "created_at", "updated_at", "enabled") VALUES('gago.org.ar', 1500, '2010-03-15 22:02:10', '2010-03-15 22:02:10', 't')

  def update
    @domain = Domain.find(params[:id])

    respond_to do |format|
      if @domain.update_attributes(params[:domain])
---
SELECT * FROM "domains" WHERE ("domains"."id" = 2)
UPDATE "domains" SET "updated_at" = '2010-03-17 14:53:13', "enabled" = 'f' WHERE "id" = 2

  def destroy
    @domain = Domain.find(params[:id])
    @domain.destroy
---
SELECT * FROM "domains" WHERE ("domains"."id" = 1)
DELETE FROM "domains" WHERE "id" = 1

  def reload
    f = File.new("/tmp/file.yaml", "w+")
    Domain.all.each do |d|
      value=" "
      f.puts "#{d.name.gsub(".","_")}:"
      value=" yes" if d.enabled
      f.puts "\tenabled:#{value}"
      f.puts "\tttl: #{d.ttl}"
      address=[]
      acls=[]
      d.records.each do |r|
---
SELECT * FROM "domains"
SELECT * FROM "records" WHERE ("records".domain_id = 2)