app/controllers/records_controller.rb

  def index
    @records = Record.all
---
SELECT * FROM "records"

  def show
    @record = Record.find(params[:id])
---
SELECT * FROM "records" WHERE ("records"."id" = 1)

  def create
    @record = Record.new(params[:record])

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("address", "created_at", "updated_at", "domain_id", "acl") VALUES('', '2010-03-15 21:03:39', '2010-03-15 21:03:39', NULL, '')

  def destroy
    @record = Record.find(params[:id])
    @record.destroy
---
SELECT * FROM "records" WHERE ("records"."id" = 1)
DELETE FROM "records" WHERE "id" = 1